{
  "aceite_termo": "I hereby declare that I agree to participate in the research entitled \"Software Engineering Practices in Digital Game Development\", etc...",
  "ufrom": "Where are you from?",
  "formacao": "What is your highest level of education?",
  "area_formacao": "What is your main area of education?",
  "anos_experiencia": "How many years have you worked with game development?",
  "tamanho_maior_time": "Including you, how many people were on the largest game development team you have worked with?",
  "qtd_projetos": "How many game projects have you worked on? (include those that were not released)",
  "qtd_lancados": "How many game projects have been released?",
  "papel_principal": "What is your main role (what you mostly do) in game development?",
  "ferramentas_desenvolvimento": "What tools do you usually use to develop games?",
  "tipos_jogos": "What types of games do you usually produce?",
  "processos_engenharia": "What software engineering processes do you usually use?",
  "opiniao_praticas": "What do you think of these practices?",
  "testes": "Your tests:",
  "usa_framework_teste": "Do you use any testing framework for your games?",
  "qual_framework": "If so, which one (including engine)?",
  "como_testou": "What have you used to perform the tests?",
  "o_que_e_testado": "What is tested in the automated tests?",
  "inicio_testes": "At what stage are automated tests usually created?",
  "como_faz_teste": "To perform the automated tests:",
  "framework_teste_2": "If using a framework, specify (including engine):",
  "teste_como_requisito": "Do you use tests as a requirement for anything?",
  "consideracoes_finais": "Any final comments?",
  "contato_entrevista": "Would you like to be contacted for a detailed interview?",
  "email": "Your email? (optional)",
  "enviar": "Submit",
  "sim": "Yes",
  "nao": "No",
  "formacao_opcoes": {
    "fundamental": "Elementary School",
    "medio": "High School",
    "graduacao": "Undergraduate",
    "especializacao": "Specialization",
    "mestrado": "Master's",
    "doutorado": "PhD"
  }
}
