{
  "consent": {
    "title": "Registro de Consentimiento Libre e Informado (RCLI)",
    "helper": "Si algún término no está claro, intente leerlo en otro idioma.",
    "paragraphs": [
      "Se le invita a participar en la investigación <strong>“Quality Promotion Practices in Game Development: An Observational Study”</strong>, realizada por Esdras Caleb Oliveira Silva (investigador principal) y Lyrene Fernandes da Silva (supervisora).",
      "Esta investigación está destinada exclusivamente a personas <strong>mayores de 18 años que trabajan en el desarrollo de videojuegos digitales</strong>.",
      "Buscamos identificar formas de integrar prácticas de pruebas automatizadas en el desarrollo de juegos, especialmente en contextos de equipos independientes.",
      "Si decide participar, responderá a <strong>28 preguntas</strong> sobre su perfil como desarrollador de juegos, las prácticas de ingeniería de software que utiliza y los tipos de pruebas empleadas en la validación de los juegos.",
      "El tiempo estimado para responder a todas las preguntas es de 15 minutos. Puede sentir una ligera incomodidad por el tiempo necesario para responder a todas las preguntas, pero el formulario guarda sus respuestas automáticamente en el navegador, permitiéndole continuar más tarde.",
      "<strong>Riesgos, Confidencialidad y Beneficios:</strong><br />Su participación implica riesgos mínimos. El riesgo principal es el cansancio al responder el cuestionario, lo cual se mitiga con la opción de guardar sus respuestas para continuar después. Al ser una investigación en línea, existen riesgos asociados al entorno virtual, como la violación de la confidencialidad. Para proteger su información, nosotros, los investigadores, hemos adoptado las siguientes medidas:<br /><ul><li><strong>Recolección de Datos:</strong> Sus respuestas serán anónimas. Recopilaremos el idioma de su navegador y del formulario para su análisis. Proporcionar su correo electrónico es <strong>opcional</strong> y solo se utilizará si desea participar en una entrevista para la investigación.</li><li><strong>Seguridad:</strong> Asumimos la responsabilidad de almacenar todos los datos en un entorno digital seguro y con acceso restringido para garantizar su confidencialidad.</li></ul><strong>Beneficios:</strong> De forma directa, las preguntas pueden ayudarle a reflexionar sobre sus prácticas de trabajo. De forma indirecta, su contribución generará conocimiento para la comunidad de desarrollo de videojuegos y ayudará en la creación de un futuro marco de trabajo (framework) de pruebas automatizadas.",
      "En caso de dudas, póngase en contacto con:<br /><strong>Esdras Caleb Oliveira Silva</strong> – SEDIS/UFRN<br />Av. Sen. Salgado Filho, 3000, Lagoa Nova, Natal/RN, CEP 59078-970<br />Correo electrónico: <a href=\"mailto:acheicaleb@gmail.com\">acheicaleb@gmail.com</a><br />Teléfono: +55 (84) 99688-8803",
      "Puede negarse a participar o retirarse en cualquier momento, sin perjuicio ni penalización.",
      "Los datos proporcionados, a excepción del correo electrónico opcional, serán anónimos y confidenciales, se utilizarán exclusivamente para fines académicos y se almacenarán durante 5 años.",
      "Las dudas éticas pueden ser aclaradas con el Comité de Ética en Investigación de la UFRN (CEP Central/UFRN):<br />WhatsApp: (84) 99193-6266<br />Correo electrónico: <a href=\"mailto:cepufrn@propesq.ufrn.br\">cepufrn@propesq.ufrn.br</a><br />Dirección: UFRN – Av. Sen. Salgado Filho, 3000, Lagoa Nova, Natal/RN, CEP 59078-900",
      "También es posible contactar a la Comisión Nacional de Ética en Investigación (Conep):<br />Teléfono: (61) 3315-5877<br />Correo electrónico: <a href=\"mailto:conep@saude.gov.br\">conep@saude.gov.br</a>"
    ],
    "agree": "Acepto y deseo participar en la investigación",
    "decline": "Rechazar"
  },
  "switcher": {
    "share_browser_language": "Compartir el idioma del navegador",
    "share_survey_language": "Compartir el idioma en que se respondió la encuesta"
  },
  "thankyou": {
    "title": "Gracias por su tiempo",
    "text": "Su decisión ha sido registrada. Agradecemos su atención.",
    "removal": "Si desea que sus datos sean eliminados, por favor contacte a acheicaleb@gmail.com y envíe su ID único: {{uid}}.",
    "newSurvey": "Realizar una nueva encuesta",
    "change": "Cambiar respuestas",
    "confirmReset": "¿Está seguro? Esto eliminará los datos anteriores de su navegador (incluyendo el ID {{uid}}) y no podrán ser recuperados."
  },
  "survey": {
    "floatmenu": {
      "confirmReset": "¿Está seguro de que quiere salir?",
      "confirmResetDescription": "Esto borrará sus respuestas guardadas. Si desea continuar más tarde, simplemente vuelva después sin hacer clic aquí."
    },
    "common": {
      "sim": "Sí",
      "nao": "No",
      "required_option": "Por favor, seleccione una opción.",
      "required_one_option": "Por favor, seleccione al menos una opción.",
      "required_describe": "Por favor, especifique.",
      "outra": "Otra",
      "outro": "Otro",
      "outra_describe": "¿Cuál otra?",
      "outro_describe": "¿Cuál otro?"
    },
    "year_of_birth": "¿En qué año nació?",
    "country_work": "¿En qué país trabaja/opera principalmente en el desarrollo de videojuegos?",
    "formacao": "¿Cuál es su nivel de estudios más alto?",
    "formacao_opcoes": {
      "none": "Ninguno",
      "fundamental": "Educación Primaria",
      "medio": "Educación Secundaria",
      "graduacao": "Grado Universitario",
      "especializacao": "Especialización",
      "mestrado": "Maestría",
      "doutorado": "Doctorado"
    },
    "area_formacao": "¿En qué área se encuentra su nivel de estudios más alto?",
    "area_formacao_o": {
      "computacao": "Ciencias de la Computación / Ingeniería de Software / Sistemas de Información",
      "engenharia": "Ingeniería (otras áreas)",
      "jogos": "Diseño de Videojuegos / Desarrollo de Videojuegos Digitales",
      "design": "Diseño Gráfico / Artes Visuales / Animación",
      "musica": "Música / Producción de Audio",
      "comunicacao": "Comunicación / Medios Digitales / Multimedia",
      "autodidata": "Autodidacta (sin formación académica)"
    },
    "anos_experiencia": "¿Desde hace cuántos años trabaja en la industria del desarrollo de videojuegos digitales?",
    "qtd_projetos": "¿En cuántos proyectos de videojuegos (lanzados o no) ha trabajado?",
    "situacao": "¿Cuál es su rol principal en el desarrollo de videojuegos digitales hoy en día? (Seleccione la opción que mejor describa su situación actual.)",
    "situacao_o": {
      "atuacao_industria_integral": "Trabajo a tiempo completo en una empresa de la industria de los videojuegos digitales",
      "atuacao_industria_parcial": "Trabajo a tiempo parcial en una empresa de la industria de los videojuegos digitales",
      "atuacao_freelancer": "Desarrollo videojuegos como freelancer/autónomo de forma regular",
      "atuacao_indie_horas_vagas": "Desarrollo videojuegos de forma independiente en mi tiempo libre (sin remuneración o con pago ocasional)",
      "atuacao_eventual": "Desarrollo videojuegos ocasionalmente, en proyectos específicos o colaborativos",
      "atuacao_nao_envolvido": "Actualmente no estoy involucrado en el desarrollo de videojuegos digitales, pero tengo la intención de volver a esta área."
    },
    "situacao_equipe": "¿Con qué tipo de equipo suele trabajar en proyectos de desarrollo de videojuegos? Considere la mayoría de los proyectos en los que participa.",
    "situacao_equipe_o": {
      "individual": "Trabajo solo(a) (proyectos individuales)",
      "pequena": "En un equipo pequeño (2 a 5 personas)",
      "media": "En un equipo mediano (6 a 15 personas)",
      "grande": "En un equipo grande (más de 15 personas)",
      "varia": "Varía mucho de un proyecto a otro",
      "nao_participa": "Trabajo de forma independiente y no tengo contacto directo con el equipo del proyecto"
    },
    "duracao_projetos": "En promedio, ¿cuál es la duración de los proyectos en los que participa?",
    "duracao_projetos_o": {
      "menos_1_mes": "Menos de 1 mes",
      "1a3_meses": "De 1 a 3 meses",
      "4a6_meses": "De 4 a 6 meses",
      "7a12_meses": "De 7 a 12 meses",
      "mais_1_ano": "Más de 1 año"
    },
    "funcoes": "¿Qué roles/funciones desempeña habitualmente?",
    "funcoes_o": {
      "programador": "Programador(a)",
      "artista": "Artista Visual",
      "design_ux": "Diseño de Interfaz de Usuario",
      "roteiro_narrativa": "Guion/Narrativa",
      "gerente": "Gestión de Proyectos",
      "marketing": "Marketing/Publicación",
      "game_designer": "Diseñador(a) de Videojuegos",
      "level_designer": "Diseñador(a) de Niveles",
      "qa": "Tester (QA)",
      "artista_som": "Artista de Sonido",
      "animacao": "Animación"
    },
    "tipos_jogos": "¿Qué tipos de videojuegos desarrolla con más frecuencia?",
    "tipos_jogos_options": {
      "fps": "FPS",
      "educacional": "Educativo",
      "rpg": "RPG",
      "aventura_narrativa": "Aventura Narrativa (Novela Visual)",
      "2d": "2D",
      "3d": "3D",
      "plataforma": "Plataformas",
      "boardgame": "Juego de Mesa",
      "puzzle": "Puzzle",
      "simulacao": "Simulación",
      "manager": "Gestión"
    },
    "plataformas_desenvolvimento": "¿Para qué plataformas suele desarrollar videojuegos?",
    "plataformas_desenvolvimento_o": {
      "pc": "PC (Windows, Linux, Mac)",
      "web": "Web (navegadores)",
      "mobile": "Dispositivos móviles (Android, iOS)",
      "console": "Consolas (PlayStation, Xbox, Nintendo)",
      "xr": "Realidad Virtual / Aumentada"
    },
    "ferramentas_desenvolvimento": "¿Qué motores utiliza habitualmente en los proyectos en los que trabaja o ha trabajado?",
    "ferramentas_desenvolvimento_options": {
      "unity": "Unity",
      "unreal": "Unreal",
      "godot": "Godot",
      "gamemaker": "Game Maker",
      "rpgmaker": "RPG Maker",
      "framework_baixo_nivel": "Framework de bajo nivel (LÖVE, MonoGame, Heaps, etc.)",
      "propria_pessoal": "Motor propio personal",
      "propria_corporativa": "Motor propio de la empresa para la que trabajo/trabajé",
      "nada": "No uso motores de videojuegos (programo con bibliotecas básicas como SDL)"
    },
    "personal_context": "Perfil y Contexto Profesional",
    "uso_praticas_controle_versao": "Control de versiones (ej., Git)",
    "uso_praticas_padroes_design": "Patrones de diseño (ej., ECS, componentes)",
    "uso_praticas_modelagem_projeto": "Modelado de proyectos (ej., diagramas de flujo, diagramas de estado, etc.)",
    "uso_praticas_prototipacao": "Prototipado técnico",
    "uso_praticas_tdd": "Desarrollo Guiado por Pruebas (TDD)",
    "uso_praticas_integracao_continua": "Integración continua (builds, pipelines)",
    "uso_praticas": {
      "label": "Para cada una de las siguientes prácticas, seleccione la alternativa que mejor represente su experiencia en el desarrollo de videojuegos.",
      "opcoes": {
        "uso_atualmente": "La uso actualmente",
        "nao_conhece": "No la uso porque no la conozco",
        "nao_util": "No le veo utilidad para mis proyectos",
        "ja_tentou": "He intentado usarla, pero me pareció complicada o excesiva",
        "prefere_outros": "Prefiero centrarme en otras áreas del desarrollo"
      }
    },
    "dificuldades_manutencao": "En su experiencia, ¿qué es lo que más dificulta la evolución y el mantenimiento de los proyectos a lo largo del tiempo? (Elija hasta 3 opciones)",
    "dificuldades_manutencao_o": {
      "codigo_dificil": "El código se vuelve difícil de entender con el tiempo",
      "mudancas_quebram": "Hacer cambios provoca errores inesperados en otras partes del videojuego",
      "comunicacao_dificil": "Dificultad de comunicación entre los miembros del equipo",
      "prazo_curto": "Falta de tiempo o plazos ajustados",
      "mudancas_escopo": "Cambios de alcance o características a mitad del proyecto",
      "sem_boas_praticas": "Ausencia de buenas prácticas de ingeniería de software",
      "sem_dificuldades": "No encuentro dificultades significativas en este aspecto"
    },
    "testes_jogo": "¿Qué formas de prueba utiliza habitualmente para verificar que el videojuego funciona correctamente?",
    "testes_jogo_options": {
      "exploratorio": "Pruebas exploratorias: juego libremente y observo si hay fallos o comportamientos extraños",
      "roteiro": "Pruebas con guion: sigo una lista de pasos o una lista de verificación para comprobar funcionalidades específicas",
      "automatizado": "Pruebas automatizadas: uso herramientas o scripts para probar partes del videojuego sin intervención manual"
    },
    "dificuldades_testes": "Si ha intentado usar pruebas automatizadas, ¿cuáles fueron las principales dificultades? (Seleccione las principales)",
    "dificuldades_testes_options": {
      "entendimento_frameworks": "Dificultad para entender cómo funcionan las herramientas de prueba.",
      "implementacao_dificil": "Complejidad para integrar las pruebas en el flujo de trabajo del proyecto.",
      "preferencia_humanos": "La sensación de que las pruebas manuales son más prácticas o eficientes.",
      "nao_encontram_erros_reais": "La percepción de que las pruebas automatizadas no encuentran los \"errores importantes\".",
      "nunca_usei": "Nunca he intentado usar pruebas automatizadas."
    },
    "ferramentas_teste": "¿Qué herramientas ha utilizado para crear pruebas automatizadas en sus proyectos de videojuegos? (Deje en blanco si nunca ha usado ninguna)",
    "ferramentas_teste_options": {
      "unity": "Unity Test Framework",
      "unreal": "Unreal Functional Testing Framework / Gauntlet",
      "godot_tests": "Un plugin de framework de pruebas para Godot (ej., GUT o gdUnit)"
    },
    "conteudo_testado": "¿Qué aspectos del videojuego suele cubrir en las pruebas automatizadas? (Deje en blanco si no utiliza pruebas automatizadas)",
    "conteudo_testado_options": {
      "componentes": "Componentes aislados: verifico que partes específicas del código funcionen correctamente de forma independiente",
      "performance": "Rendimiento básico: evalúo el tiempo de carga, la tasa de fotogramas (FPS) o el consumo de recursos",
      "cenarios": "Escenarios de juego específicos: simulo situaciones de juego para comprobar si el videojuego responde como se espera",
      "teste_fumaca": "Pruebas de humo (Smoke tests): solo compruebo si el videojuego se inicia y se ejecuta sin fallos críticos"
    },
    "etapa_testes": "¿En qué etapa del desarrollo se crean? (Deje en blanco si no utiliza pruebas automatizadas)",
    "etapa_testes_options": {
      "antes_funcionalidade": "Antes de implementar la funcionalidad: sigo un enfoque de Desarrollo Guiado por Pruebas (TDD)",
      "durante_funcionalidade": "Durante o justo después de implementar la funcionalidad: escribo las pruebas junto con el código",
      "pos_prototipo": "Después de crear un prototipo funcional: pruebo cuando ya tengo algo jugable o comprobable",
      "final": "Solo al final del proyecto, durante la fase de revisión",
      "quando_possivel": "Cuando hay tiempo u oportunidad, sin una etapa definida en el proceso"
    },
    "requisito_testes": "¿En qué situaciones se utilizan las pruebas automatizadas como requisito obligatorio en sus proyectos?",
    "requisito_testes_options": {
      "atualizacao": "Para aceptar actualizaciones de colaboradores (ej., pull requests)",
      "proxima_fase": "Para permitir que el proyecto avance a la siguiente fase (alfa, beta)",
      "nova_funcionalidade": "Para iniciar el desarrollo de una nueva funcionalidad",
      "nunca": "No son un requisito obligatorio en los proyectos"
    },
    "software_engeniring": "Prácticas de Ingeniería y Pruebas",
    "avaliacao_artefatos": "¿Cómo suele evaluar la calidad de los artefactos creativos que produce (imágenes, sonidos, iconos, vídeos, diseños, etc.)?",
    "avaliacao_artefatos_o": {
      "criterios_definidos": "Uso criterios previamente definidos (ej., estilo, claridad, adecuación al público)",
      "avaliacao_subjetiva": "Hago una evaluación más subjetiva, basada en mi propia percepción",
      "testes_formais": "Realizo pruebas formales con usuarios o herramientas específicas",
      "avaliacao_por_outros": "La evaluación la realizan principalmente otras personas del equipo",
      "sem_avaliacao_estruturada": "Normalmente no realizamos una evaluación estructurada"
    },
    "design_validacao": "¿Cómo suele probar o validar su diseño antes de la implementación completa?",
    "design_validacao_options": {
      "prototipo_simplificado": "A través de prototipos jugables simplificados (digitales o analógicos)",
      "prototipo_real": "Con simulaciones físicas o del mundo real (ej., con personas, objetos, representaciones)",
      "excel": "Usando hojas de cálculo para simular sistemas o balanceo",
      "machinations": "Usando herramientas específicas (ej., Machinations)",
      "mental": "Simulo mentalmente los escenarios e interacciones"
    },
    "creative_process": "Procesos Creativos (Artista y Diseñador)",
    "areas_uso_ia": "¿De qué maneras ha estado utilizando las IA generativas (ChatGPT, Copilot, Midjourney, etc.) en el desarrollo de videojuegos?",
    "areas_uso_ia_o": {
      "ideias_criativas": "Para generar ideas creativas (ej., personajes, mecánicas, narrativas, diálogos)",
      "conteudo_visual_sonoro": "Para crear contenido visual o sonoro (ej., arte conceptual, voces, bandas sonoras, efectos)",
      "implementacao": "Para ayudar en la implementación (ej., escribir o revisar código, sugerir soluciones técnicas)",
      "planejamento": "Para planificar o estructurar el videojuego (ej., documentación, arquitectura del sistema, balanceo)",
      "testes": "Para crear o sugerir pruebas automatizadas (ej., generar casos de prueba, scripts de validación)",
      "validacao": "Para revisar o validar funcionalidades del videojuego (ej., encontrar errores, comprobar la lógica)",
      "ainda_nao_usei": "Aún no he usado IA, pero tengo curiosidad o interés",
      "nao_usarei": "No uso IA en mis proyectos de videojuegos"
    },
    "percepcao_uso_ia": "¿Cuáles son sus principales preocupaciones sobre el uso de IAs generativas en el sector? (Seleccione hasta 2 opciones)",
    "percepcao_uso_ia_options": {
      "dados_copyright": "Uso de datos con derechos de autor sin consentimiento (para entrenar la IA)",
      "privacidade": "Preocupaciones de privacidad: mis entradas pueden ser reutilizadas sin mi control",
      "substituicao": "Miedo a que los profesionales del sector sean reemplazados por la IA",
      "transparencia": "Falta de transparencia sobre cómo funciona la IA o toma decisiones",
      "originalidade": "Dificultad para validar la originalidad o fiabilidad de lo que se genera",
      "etica": "Ética en el uso de la IA (ej., autoría, créditos, plagio)",
      "sem_preocupacoes": "No tengo preocupaciones significativas en este momento"
    },
    "generative_ia": "Aplicación de IAs Generativas",
    "final_remarks": "Comentarios Finales",
    "any_comment": "¿Le gustaría dejar algún comentario final sobre las pruebas en los proyectos en los que participa?",
    "email": "Correo electrónico de contacto o referencia:",
    "contato_entrevista": "¿Nos gustaría saber más sobre las pruebas realizadas en el desarrollo de videojuegos. ¿Le gustaría ser contactado(a) para una entrevista?",
    "email_required": "Por favor, proporciónenos un medio de contacto.",
    "email_contato": "Correo electrónico de referencia (opcional):",
    "enviar": "Enviar",
    "required_fields_missing": "Por favor, responda las siguientes preguntas:"
  }
}