{
  "aceite_termo": "मैं इस फॉर्म के माध्यम से घोषणा करता/करती हूँ कि मैंने 'डिजिटल गेम डेवलपमेंट में सॉफ़्टवेयर इंजीनियरिंग प्रथाओं' शीर्षक से इस शोध में अपनी मर्जी से भाग लेने पर सहमति दी है...",
  "ufrom": "आप कहाँ से हैं?",
  "formacao": "आपकी उच्चतम शैक्षणिक योग्यता क्या है?",
  "area_formacao": "आपका मुख्य अध्ययन क्षेत्र क्या है?",
  "anos_experiencia": "आप कितने वर्षों से गेम डेवलपमेंट में कार्यरत हैं?",
  "tamanho_maior_time": "आपको शामिल करते हुए, आपने सबसे बड़े कितने सदस्यीय टीम में कार्य किया है?",
  "qtd_projetos": "आपने कितने गेम प्रोजेक्ट्स पर काम किया है? (अधूरी परियोजनाएं भी शामिल करें)",
  "qtd_lancados": "कितने प्रोजेक्ट्स को किसी प्लेटफ़ॉर्म पर रिलीज़ किया गया है?",
  "papel_principal": "गेम डेवलपमेंट में आपकी मुख्य भूमिका क्या है?",
  "ferramentas_desenvolvimento": "आप गेम बनाने के लिए किन टूल्स का उपयोग करते हैं?",
  "tipos_jogos": "आप किस प्रकार के गेम्स बनाते हैं?",
  "processos_engenharia": "आप कौन-कौन सी सॉफ़्टवेयर इंजीनियरिंग प्रक्रियाओं का उपयोग करते हैं?",
  "opiniao_praticas": "इन प्रथाओं के बारे में आपकी क्या राय है?",
  "testes": "आपके टेस्टिंग अनुभव:",
  "usa_framework_teste": "क्या आप गेम्स के परीक्षण के लिए कोई फ्रेमवर्क उपयोग करते हैं?",
  "qual_framework": "यदि हाँ, तो कृपया बताएं (इंजन सहित):",
  "como_testou": "आपने परीक्षण के लिए किन विधियों का उपयोग किया है?",
  "o_que_e_testado": "ऑटोमेटेड टेस्टिंग में किन चीजों का परीक्षण होता है?",
  "inicio_testes": "ऑटोमेटेड टेस्टिंग किस चरण में शुरू होती है?",
  "como_faz_teste": "ऑटोमेटेड टेस्टिंग कैसे की जाती है?",
  "framework_teste_2": "यदि कोई फ्रेमवर्क उपयोग करते हैं, तो बताएं (इंजन सहित):",
  "teste_como_requisito": "क्या आप परीक्षण को किसी चीज़ के लिए शर्त के रूप में उपयोग करते हैं?",
  "consideracoes_finais": "कोई अंतिम टिप्पणी?",
  "contato_entrevista": "क्या आप एक विस्तृत इंटरव्यू के लिए संपर्क चाहते हैं?",
  "email": "आपका ईमेल (वैकल्पिक)",
  "enviar": "भेजें",
  "sim": "हाँ",
  "nao": "नहीं",
  "formacao_opcoes": {
    "fundamental": "प्राथमिक",
    "medio": "माध्यमिक",
    "graduacao": "स्नातक",
    "especializacao": "विशेषज्ञता",
    "mestrado": "मास्टर्स",
    "doutorado": "डॉक्टरेट"
  }
}
